{"backend": "tensorflow", "config": {"layers": [{"config": {"dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "stateful": false, "return_sequences": false, "kernel_regularizer": null, "use_bias": true, "batch_input_shape": [null, 2000, 367], "recurrent_regularizer": null, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "tanh", "unroll": false, "bias_regularizer": null, "go_backwards": false, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "bias_constraint": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "units": 150, "unit_forget_bias": true, "implementation": 1, "dropout": 0.0, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "units": 1, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential"}