{"backend": "tensorflow", "config": {"layers": [{"config": {"recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "tanh", "units": 150, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_state": false, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "name": "lstm_1", "stateful": false, "use_bias": true, "unroll": false, "unit_forget_bias": true, "return_sequences": false, "activity_regularizer": null, "dropout": 0.0, "recurrent_regularizer": null, "kernel_regularizer": null, "implementation": 1, "recurrent_dropout": 0.0, "batch_input_shape": [null, 2000, 367], "go_backwards": false, "bias_constraint": null, "bias_regularizer": null, "recurrent_constraint": null}, "class_name": "LSTM"}, {"config": {"use_bias": true, "kernel_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "units": 1, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_1"}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential"}