{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Embedding", "config": {"output_dim": 32, "activity_regularizer": null, "dtype": "float32", "name": "embedding_1", "batch_input_shape": [null, 500], "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "mask_zero": false, "input_dim": 5000, "embeddings_regularizer": null, "input_length": 500, "embeddings_constraint": null, "trainable": true}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "activation": "tanh", "go_backwards": false, "stateful": false, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "use_bias": true, "unit_forget_bias": true, "kernel_constraint": null, "units": 100, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "bias_constraint": null, "unroll": false, "kernel_regularizer": null, "bias_regularizer": null, "implementation": 1, "return_state": false, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "return_sequences": false}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 1, "trainable": true, "name": "dense_1", "bias_constraint": null, "activation": "sigmoid", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}], "name": "sequential_1"}}