{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "lstm_1", "unit_forget_bias": true, "unroll": false, "recurrent_constraint": null, "go_backwards": false, "return_sequences": false, "kernel_constraint": null, "units": 150, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "tanh", "return_state": false, "dropout": 0.0, "dtype": "float32", "bias_regularizer": null, "activity_regularizer": null, "stateful": false, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "batch_input_shape": [null, 2000, 367], "kernel_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "units": 1, "trainable": true}}]}}